{
   "_id": "local:fr",
   "ALERT_RELOAD": "Si vous rechargez la page votre session va être terminé. Êtes-vous sûr(e) ?",
   "Login": "Identifiant",
   "Password": "Mot de passe",
   "Submit": "Envoyer",
   "Sign up": "S'enregistrer",
   "{{$count}} element": [
       "{{$count}} element",
       "{{$count}} elements"
   ],
   "Open": "Ouvrir",
   "Rename": "Renommer",
   "Share": "Partager",
   "Cut": "Couper",
   "Copy": "Copier",
   "Paste": "Coller",
   "Delete": "Supprimer",
   "New File": "Nouveau document",
   "New Folder": "Nouveau dossier",
   "Normal right click": "Clic droit normal",
   "Cancel": "Annuler",
   "Login:": "Identifiant :",
   "Password:": "Mot de passe :",
   "Confirm password:": "Répéter le mots de passe :",
   "Public name (optional):": "Pseudonyme (optionnel) :",
   "new document": "nouveau document",
   "new folder": "nouveau dossier",
   "Shares": "Partages",
   "README": "LISEZ MOI",
   "INFO_SIGNUP": "<p>Sur cette page, vous pouvez créer un compte, qui vous permettra d'accéder au prototype.</p>\n\n<p>Sur un site internet classique, une création de compte consiste généralement à vous demander un identifiant, un mot de passe (et beaucoup d'autres informations) et à les stocker sur un serveur, pour pouvoir vous reconnaître lors de votre prochaine visite.</p>\n\n<p>Ici le fonctionnement est très différent, nous allons détailler les étapes\n<ol>\n  <li>génération d'un clé dite \"symétrique\" qui servira à chiffrer (= verrouiller) toutes vos données avant qu'elles ne soient stockées sur le serveur : elle est générée à partie de votre identifiant et votre mot de passe.</li>\n  <li>génération d'un couple de clés dites \"asymétriques\" : il s'agit de deux clés associées ; l'une est publique et connue de tous, elle est utilisée pour chiffrer des informations ; l'autre est dite \"privée\", elle ne doit être connue que de son propriétaire car elle permet de déchiffrer tout ce qui a été chiffré avec la clé publique ; par analogie, la clé publique peut être vue comme un cadenas ouvert (n'importe qui peut l'utiliser pour fermer une boîte) et la clé privée est la clef (physique) qui ouvre ce cadenas (seul le détenteur de cette clef peut ouvrir le cadenas et donc la boîte) ; ce mécanisme est utilisé pour le partage entre utilisateurs</li>\n  <li>stockage de la clé publique dans la base de données sans chiffrement : il est nécessaire que tout le monde puisse la lire</li>\n  <li>création de la racine de l'arborescence de fichiers</li>\n  <li>chiffrement et stockage de la clé privée, du dossier racine et de l'identifiant de la clé publique</li>\n</ol>",
   "INFO_SIGNIN": "<h4>Bonjour et bienvenue sur le prototype de Lupo Libero !</h4>\n<p>Ce petit guide vous suivra de page en page pour vous expliquer les différentes possibilités de ce futur service.</p>\n\n<p>Dans un premier temps, vous pouvez créer un compte en cliquant sur le bouton \"s'enregistrer\". Les prochaines fois vous pourrez directement vous identifier par cette page.</p>\n\n<p>Avec Lupo Libero, votre mot de passe n'est jamais envoyé sur internet. Il est utilisé, ainsi que votre identifiant pour générer une clé secrète qui servira à chiffrer (= verrouiller) tous vos fichiers avant qu'ils ne soient envoyés sur les serveurs. Sans votre identifiant et votre mot de passe, il faut théoriquement plusieurs milliers d'ordinateurs et plusieurs décénies pour réussir à lire vos fichiers.</p>\n\n<p>Pour que vos données soient réellement en sécurité il est crucial de choisir un mot de passe complexe et suffisament long (au moins 8 caractères). S'il est trop simple, un attaquant pourra le trouver en automatisant l'essai de toutes les combinaisons possibles. Pour augmenter la complexité de votre mot de passe, utiliser des majuscules, des minuscules, des chiffres et des caractères spéciaux. Veillez également à ne pas utiliser de mot du dictionnaire ou de nom propre.</p>",
   "README_CONTENT": "Avertissement\n\nAvant d'aller plus loin nous devons vous avertir sur deux points :\n\n* ce prototype n'a pas le niveau de sécurité du futur service Lupo Libero, en particulier, si vous partager un ou plusieurs fichiers avec une personne (seulement dans ce cas), celle-ci peut techniquement (si elle en a les compétences) obtenir l'accès à vos autres fichiers. A noter également que nous n'avons pas encore vérifier minutieusement les algorithmes que nous utilisant, or une petite erreur peut considérablement fragilisé la sécurité de l'ensemble. Donc n'utilisez pas ce prototype pour des données sensibles\n\n* ce prototype ne doit pas être considérer comme un service de stockage : il va techniquement beaucoup évoluer et nous seront parfois contraint de supprimer toutes les données car nous auront fait un changement incompatible avec les fichiers existants. De même la partie logicielle n'est pas encore stable, il peut donc survenir des bugs qui peuvent découler sur une perte de données. Donc ne stockez pas des données que vous ne pouvez pas vous permettre de perdre (ou stockez les à plusieurs endroits)",
   "INFO_EXPLORER.FILES": "<p>Vous êtes maintenant dans l'explorateur de fichiers de Lupo. Il a été construit de manière à être très similaire à un explorateur de système d'exploitation.</p>\n\n<p>Vous pouvez :\n<ul>\n  <li>créer un fichier dossier (clic droit dans le grand cadre)</li>\n  <li>créer un document (clic droit dans le grand cadre)</li>\n  <li>ajouter des fichiers depuis votre ordinateur par glissé-déposé : vous ouvrez l'explorateur de fichiers de votre système au dessus de votre navigateur ou à côté ; vous sélectionnez les fichiers que vous souhaitez ajouter ; vous cliquez sur un des fichiers et vous déplacez la souris tout en maintenant le bouton enfoncé ; lorsque votre pointeur arrive sur le grand cadre de l'explorateur Lupo, un \"+\" apparaît ; vous pouvez relâcher le bouton de votre souris ; les fichiers sont alors ajoutés</li>\n  <li>ouvrir/télécharger un fichier (double clic dessus ou clic-droit + \"ouvrir\")</li>\n  <li>ouvrir un dossier (double clic dessus ou clic-droit + \"ouvrir\")</li>\n  <li>partager un fichier ou dossier avec un autre utilisateur</li>\n</ul>\n</p>\n\n<h4>Détails techniques</h4>\n<h5>L'ajout d'un fichier</h5>\n<p>Lorsque vous ajoutez un fichier :\n<ul>\n<li>il est chargé dans le navigateur</li>\n<li>si c'est une image, une image d'aperçu est construite</li>\n<li>le fichier est chiffré avec votre clé symétrique</li>\n<li>puis il est envoyé sur le serveur sous la forme de deux documents tous deux chiffrés : le premier contient les métadonnées (nom, type, aperçu, liste des partages, taille, etc.), le second contient les données du fichiers (les octets qui composent l'image, le document...)</li>\n</ul>\n</p>\n\n<h5>Le téléchargement</h5>\n<p>Lorsque vous téléchargez un document, c'est la même suite d'opération, mais en ordre inverse, avec un déchiffrement là où il y avait un chiffrement (et sans image d'aperçu).</p>\n\n<h5>Le partage</h5>\n<p>Dans ce prototype, partager consiste à fournir deux informations à une personne :\n<ul>\n<li>l'identifiant technique du fichier partagé (et non pas le nom réel du fichier)</li>\n<li>la clé symétrique qui a servit à chiffrer ce fichier (c'est-à-dire la clé symétrique de celui qui partage)</li>\n</ul>\nCes informations sont insérées dans un document qui est chiffré avec la clé publique du destinataire du partage. Ainsi lui seul peut utiliser ces deux informations.</p>\n\n<p>Dans la version finale cette étape sera bien plus complexe (et bien plus sécurisée) car tous les fichiers ne seront pas chiffrés avec les mêmes clés. Ainsi il faudra gérer beaucoup de clé et partager les bonnes clés avec les bonnes personnes. Cette fonctionnalité est une part importante du coût de développement de Lupo et c'est aussi une de celle qui fera la différence avec ce qui existe déjà : elle permet d'avoir en même temps un chiffrement de bout en bout de toutes ses données et de partager seulement un fichier avec une personne (à notre connaissance très peu de service le permettent).</p>\n\n"
}